Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.GetServiceSwapOutInitialSizes
Gets the service swap out initial sizes.
Returns:
Returns the service swap out initial sizes.
Since:
2017

Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.SwitchToInlineFittingsTab
Makes the innline fittings tab active in the Change Service window.
Since:
2017

Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.GetServiceSwapOutProfiles
Gets the service swap out profile types.
Since:
2017

Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.GetServiceSwapOutDomain
Gets the service swap out domain.
Returns:
The domain type.
Since:
2017

Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.GetServiceSwapOutSizeMappings
Gets the set of service swap out size mappings.
Returns:
The set of service swap out size mappings.
Since:
2017

Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.GetDefaultTypeMappings
Gets the set of default maps for part type mappings.
Since:
2017

Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.GetServiceSwapOutPartTypeMappings
Gets the set of service swap out part type mappings.
Returns:
The set of service swap out part type mappings.
Since:
2017

Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.GetServiceSwapOutServiceIds
Gets the set of service ids to be swapped out.
Returns:
The set of service ids.
Since:
2017

Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.GetCurrentSolutionPartTypeIds
Returns set of fabrication part types that are used in the currently selected solution.
Returns:
The set of ElementIds.
Since:
2017

Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.GetAllSolutionsPartsTypeCounts
Returns the total fabrication part type usage count in all routing solutions.
Since:
2017

Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.GetFilteredSolutionsPartsTypeCounts
Returns the active fabrication part type usage count in fitlered routing solutions.
Since:
2017

Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.GetRequiredFabricationPartTypeIds
Returns set of required fabrication part types in use in routing solution mode.
Returns:
The set of ElementIds for for required fabrication part types that is in use in routing solution mode.
Since:
2017

Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.GetFabricationPartTypeIds
Returns set of fabrication part types in use in the routing solution mode.
Returns:
The set of ElementIds for for fabrication part types that is in use in routing solution mode.
Since:
2017

Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.DeleteFailuresState
The state to enable or disable the deletion of elements that encountered failures.
Since:
2017

Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.MappingState
The state to enable or disable the mappings page.
Since:
2017

Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.NumberOfSolutions
The number of active solutions in routing solution mode.
Since:
2017

Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.ServiceId
The identifier for the fabrication service.
Since:
2017

Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.Operation
The operation associated with this event
Since:
2017

Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs
The event arguments used by the FabricationPartBrowserChangedEventArgs event.
Since:
2017